{
  "announcements": [
    {
      "title": "REGULAR SUNDAY SCHEDULE",
      "description": "<ul><li>8:30am: Prayer in the Parlor</li><li>9:30am: Children’s Sunday School</li><li>9:30am: Adult Sunday Studies, in Fellowship Hall, “What We Believe: Knowing & Loving our Doctrines” - Next week begins ‘How Redemption is Applied in the Church’</li><li>10:30am: Worship Service</li><li>12:00pm: Fellowship Lunch - All are welcome, visitors eat free</li></ul>"
    },
    {
      "title": "20s/30s AROUND THE WORLD GAME NIGHT",
      "date": "March 2",
      "description": "Hey Friends! Come join us in the Fellowship Hall at CPC New Haven on Saturday, March 2 for a fun night of games, fellowship and yummy cuisine from around the world beginning at 6:30 p.m. If you feel inclined, please bring a food item to share from any culture or continent of your choice, but come regardless! If you have questions, contact Josh S. at joshuatsanders@yahoo.com."
    },
    {
      "title": "CONGREGATIONAL MEETING MARCH 10 TO ELECT ELDERS",
      "date": "March 10",
      "description": "As mentioned in our email to the congregation (hard copies are in the foyer), we are excited to be at the final step of Tyler Rice’s and Josh Kebabian’s apprenticeship to become Ruling Elders. After almost three years of training and examination by the current elders, they are eligible for a vote. All members are invited to a congregational meeting to vote whether or not to elect them, immediately following worship on March 10. We will also be opening nominations that day for our Servant Leader Board."
    },
    {
      "title": "EASTER FELLOWSHIP MEALS",
      "date": "March 31",
      "description": "Easter In-Home Fellowship Meals are returning, March 31 at various times and locations. Easter is an opportunity for us to celebrate the risen king as a family. And what better way to do this than sitting around a table with family and friends giving thanks to Jesus for his wonderful gift of salvation? So if you are looking to join or host others in the congregation for an Easter meal please sign up by March 24 and you will be assigned to a host home. All are welcome!"
    },
    {
      "title": "HOMELESS DRIVE NOW THROUGH JAN 2024",
      "description": "We will be collecting items for those experiencing homelessness in the greater New Haven area through January 2024. Items needed: blankets, sleeping bags, hats, gloves, coats, socks, boots, tents, backpacks/duffle bags, toiletries, underwear, hand warmers. Please wash any used items and leave them in the \"Homeless Drive\" bin in the foyer. All items will be delivered to the CSHHC Homeless team and distributed to those in need. Contact Anna: asgraham07@gmail.com."
    },
    {
      "title": "DROP-IN TIME WITH PASTOR CRAIG",
      "schedule": "Fridays from 7am-10am",
      "description": "Anyone is invited to come to Craig’s office, 2nd floor of the old building (you may ring the Bradley St. doorbell), for a casual time of discussion, Q&A, prayer, coffee, tea, really whatever you want to make it! Wondering what God is doing in a certain part of your life? Let’s wonder together! Are you reading Emotionally Healthy Spirituality? Let’s discuss! Have a tricky situation at home or work? Let’s discern best steps! Want to just chat about nothing in particular? Come on in! If you have a more private or formal need, you’re always welcome to set up a separate time with Pastor Craig (craig.luekens@cpcnewhaven.org), but this is meant to be a space where anyone can drop in. Confirm that Craig is there on any given week on the calendar:"
    }
  ]
}