{
  "announcements": [
    {
      "title": "FALL WORK DAY AND CHRISTMAS DECOR SET UP",
      "date": "DEC. 2",
      "time": "9a-12noon",
      "description": "Let's join together as the family of God to take care of our grounds and facilities, both inside and out. This is a (surprisingly fun!) way to gather together to rake, clean, and organize around our building. Please join if you can."
    },
    {
      "title": "HILL CHRISTMAS STORE",
      "date": "Donate by Dec. 3",
      "description": "Please join us in sharing our 11th year of Christmas joy with some wonderful families from New Haven’s Hill community. Take an ornament from the Christmas tree in the CPC foyer and return it with an unwrapped gift valued at $15 or more for a child in the designated category (e.g., “Girl, 9-14”). In the spirit of empowerment, your gift will in turn be bought at a very reduced price by families in the Hill at the store on December 9."
    },
    {
      "title": "LESSONS & CAROLS",
      "date": "DEC. 8 @6pm",
      "description": "Save the Date for our annual service as we anticipate and celebrate the coming of Christ. This is a great service for inviting friends and neighbors! After our service of readings and worship songs, there will be a reception in the fellowship hall."
    },
    {
      "title": "YOU’VE GOT MAIL",
      "date": "Please mail it by Dec. 3.",
      "description": "Let’s encourage our covenant college kids! One significant way we at CPC can accomplish this is by sending them letters of encouragement. College years are formative years and as their church family we have a great opportunity to help them along in their journey into adulthood. If anyone would like to write a letter to our college students, please contact Jerry Ornelas at jerry.ornelas@cpcnewhaven.org. He will connect you with a student. Please mail it by Dec. 3."
    },
    {
      "title": "HOMELESS DRIVE NOW THROUGH JAN 2024",
      "description": "We will be collecting items for those experiencing homelessness in the greater New Haven area through January 2024. Items needed: blankets, sleeping bags, hats, gloves, coats, socks, boots, tents, backpacks/duffle bags, toiletries, underwear, hand warmers. Please wash any used items and leave them in the \"Homeless Drive\" bin in the foyer. All items will be delivered to the CSHHC Homeless team and distributed to those in need. Contact Anna: asgraham07@gmail.com."
    },
    {
      "title": "DROP-IN TIME WITH PASTOR CRAIG",
      "schedule": "Fridays from 7am-10am",
      "description": "Anyone is invited to come to Craig’s office, 2nd floor of the old building (you may ring the Bradley St. doorbell), for a casual time of discussion, Q&A, prayer, coffee, tea, really whatever you want to make it! Wondering what God is doing in a certain part of your life? Let’s wonder together! Are you reading Emotionally Healthy Spirituality? Let’s discuss! Have a tricky situation at home or work? Let’s discern best steps! Want to just chat about nothing in particular? Come on in! If you have a more private or formal need, you’re always welcome to set up a separate time with Pastor Craig (craig.luekens@cpcnewhaven.org), but this is meant to be a space where anyone can drop in. Confirm that Craig is there on any given week on the calendar:"
    }
  ]
}