{
  "announcements": [
    {
      "title": "NEXT SUNDAY-ELDER ORDINATION",
      "description": "We are grateful for God’s provision of two new Ruling Elders for the shepherding of our church. Next Sunday in the worship service Tyler Rice and Joshua Kebabian will be ordained to this sacred office. All members will be taking a vow as well. Praise God for His faithful undershepherds!",
      "dateEntered": "2024-04-14",
      "active": "false"
    },
    {
      "title": "I HEART NEW HAVEN DAY JUNE 1ST",
      "description": "Mark your calendars for June 1st for Bridges of Hope’s annual I Heart New Haven Day! This is an exciting day joining with other churches around the city to love the greater New Haven area with projects such as clean up, gardening, painting, and repair at places like soup kitchens, local schools, animal shelters and many other places. As always, we’ll gather on the green for worship and prayer first, and then disperse out to our projects. Please register now!",
      "dateEntered": "2024-04-14",
      "backgroundIMG": "https://static01.nyt.com/images/2022/06/05/realestate/01LIVING-NEWHAVEN-01/01LIVING-NEWHAVEN-videoSixteenByNineJumbo1600.jpg",
      "active": "false"
    },
    {
      "title": "ALL ARE WELCOME TO JOIN US FOR LUNCH DOWNSTAIRS",
      "description": "VISITORS EAT FREE",
      "dateEntered": "2024-04-14",
      "active": "false"
    },
    {
      "title": "JOINT ASCENSION SERVICE MAY 19TH 4PM @CPC EAST LYME",
      "description": "We will be worshiping with the other local Mission Anabaino churches and church plants, this time at the worship service of our newest church plant in East Lyme. Let’s join together in praise with brothers and sisters from the Hill, Fairfield, Norwalk, Wallingford, Milford, and East Lyme! There will be a meal afterwards, which is a great chance to fellowship with other Christians from around Southern CT. Location is Niantic Baptist Church building, 443 Main St., Niantic, CT 06357. Note the change in date from previously published.",
      "dateEntered": "2024-04-14",
      "backgroundIMG": "https://ctvisit.com/sites/default/files/styles/square_600x600/public/mccooksunrise.jpg?itok=gUbFV7yD",
      "active": "false"
    },
    {
      "title": "WOMEN’S HAPPY HOUR MAY 31ST",
      "description": "Please join the Women of CPC as we gather on the terrace of Il Gabbiano on Friday, May 31st from 4-7:30pm (we will be inside if the weather doesn't cooperate). Appetizers are on us and Happy Hour drink pricing is from 4-5pm. Come kick off the weekend, catch up with each other, and have a little fun with your CPC sisters. Il Gabbiano is located at 50 Long Wharf Drive in New Haven. We hope to see you there!",
      "dateEntered": "2024-04-14",
      "active": "false"
    },
    {
      "title": "JOIN THE GREEN TEAM!",
      "description": "If you are interested in serving your church while getting exercise AND having fun-in-the-sun when the weather is not, well, WINTER!, then contact jennifer@cpcnewhaven.org right away! We are in need of anyone who has two legs, at least 20/50 vision, and an hour or so available every 6-8 weeks during the growing season to help keep our beautiful non-native shortgrass meadow under control, and ready for picnics. All those interested in free, impromptu fine gardening and horticulture lessons from a certified professional may also apply.",
      "dateEntered": "2024-06-24", 
      "active": "true"
    },
    {
      "title": "PASTOR’S BOOK PICK - The Life We’re Looking For",
      "description": "This summer, we’re suggesting that you pick up Andy Crouch’s latest book - The Life We’re Looking For: Reclaiming Relationship in a Technological World. This is a perfect followup to The Soul of Shame, as it gets us to reconsider all the ways we are distracted or prevented from deeper relationships. Crouch is a wonderfully thoughtful and practical Christian thinker, who served as a Campus Minister at Harvard, and now works primarily as a consultant at Praxis for redemptive entrepreneurship. This is a great summer read to help us all prioritize and re-calibrate our lives around Christ! Copies are in the foyer, pay what you can.",
      "dateEntered": "2024-06-24", 
      "active": "true"
    },
    {
      "title": "SUMMER COLLEGE BIBLE STUDY WEDNESDAYS at 6PM",
      "description": "If you are in college, or are preparing to go to college, and are sticking around for the summer, join me for a summer bible study. We will walk through the book of Judges to see the glory of salvation from sin and ultimately point us to Jesus. We will begin our study at CPC 6PM next Wednesday. Contact Pastor Jerry at jerry.ornelas@cpcnewhaven.org for more information. Friends are welcome.",
      "dateEntered": "2024-06-24",
      "active": "false"
    },
    {
      "title": "JOINING WITH CPC IN THE HILL THIS SUMMER",
      "description": "We’re invited to serve with our brothers and sisters in Christ at our sister church in the Hill this summer. Currently 3-6 volunteers are needed at the Wednesday BBQs beginning on July 3rd through August 21st, from 5pm-7pm.",
      "dateEntered": "2024-06-24",
      "active": "false"
    },
    {
      "title": "MINISTRYSAFE VIDEOS - FOR ANYONE VOLUNTEERING WITH OUR CHILDREN",
      "description": "As we announced at our congregational meeting, we are requiring all children volunteers to watch the Ministry Safe videos before the fall. The video is a Sexual Abuse Awareness training, so some will prefer to watch it in a group, though it can be watched at home at your convenience. We’ll be showing the video after the service in the Fellowship Hall on June 23, July 21, and Aug. 18. You need to only come once. Light snacks will be provided.",
      "dateEntered": "2024-06-24",
      "active": "false"
    },
    {
      "title": "SATURDAY MORNING BAKE ALONG",
      "description": "Women of CPC — Do you have a sweet tooth or do you enjoy having sweet fellowship with one another? Mark your calendars now for Saturday, August 10th at 10am! We'll be gathering at Katalina's Bakery in New Haven (74 Whitney Ave). Our own resident expert baker, Kathy Reiglemann, will host us in a baking class for all skill levels and none ;-). You can also just come hang out over a cup of tea or coffee. Invite a friend or neighbor - It's Scone'a be a good time!",
      "dateEntered": "2024-06-24",
      "active": "false"
    },
    {
      "id": "2024-001",
      "title": "NEW BULLETIN THIS SUNDAY!",
      "description": "The staff have been hard at work updating the bulletin, and we are unveiling the new one this Sunday. There are 2 main changes. First, we have removed the reasoning and biblical quotes that remain the same each week and created a separate insert that will live in the pews. This “Worship Guide” explains our movements of worship. Second, we removed the song lyrics, which will be a change for many people who have grown dependent on the text in hand. If you struggle with reading the slides for worship, we’re still providing a Large Print bulletin. With the lyrics removed, however, we hope it will encourage all of our eyes to be lifted up and singing in more communal ways. We know change can be difficult but hopefully it feels more like who we are and allows for more dynamic worship.",
      "dateEntered": "2024-08-25",
      "active": "false",
      "type": "highlight",
      "category": "highlight or ongoing"
    },
    {
      "id": "2024-002",
      "title": "FACILITIES TEAM NEEDS YOU!",
      "description": "There are a number of small fixes and tweaks that are in need of attention around our building and grounds. If you’re interested in helping out - even if your handy skill level is low - please volunteer. Email fred.walker@yale.edu to help out.",
      "dateEntered": "2024-08-25",
      "active": "false",
      "type": "ongoing",
      "category": "ongoing"
    },
    {
      "id": "2024-003",
      "title": "BOH MENTOR TRAINING SESSION",
      "description": "This is a great opportunity for interested mentors to meet current mentors, see the mentoring program space and get ideas about becoming the best mentor they can be! This training will be Saturday, Aug 31 from 2-4pm. Contact Wayne Hammond (wayne.hammond@bridgesnewhaven.org or 203-993-3970) with any questions.",
      "dateEntered": "2024-08-25",
      "active": "false",
      "type": "highlight",
      "category": "highlight"
    },
    {
      "id": "2024-004",
      "title": "A GLIMPSE INTO THE FALL SCHEDULE",
 "description": "<style>table { width: 100%; border-collapse: collapse; background-color: #ffffff; color: #000; box-shadow: 0 4px 8px rgba(0, 0, 0, 0.1); border-radius: 8px; overflow: hidden; } td, th { border: 1px solid #ddd; padding: 8px; } th { padding-top: 12px; padding-bottom: 12px; text-align: left; background-color: #ccc; text-align:center; color: black; } tr:nth-child(even){background-color: #f2f2f2;} </style><table><tr><th>Date</th><th>Event</th></tr><tr><td>9/8/24</td><td>Full Sunday Schedule resumes</td></tr><tr><td>8:30</td><td>Prayer</td></tr><tr><td>9:30</td><td>Children’s and Adult Sunday Studies</td></tr><tr><td>After Worship</td><td>Weekly Fellowship Lunches</td></tr><tr><td>9/8/24</td><td>Welcome Sunday (Lunch and Kids Crafts outdoors)</td></tr><tr><td>9/15/24</td><td>Congregational Meeting, discussing Annual Ministry Plan</td></tr><tr><td>9/22/24</td><td>Ministry Fair</td></tr><tr><td>10/5/24</td><td>Women’s Welcome Brunch</td></tr><tr><td>10/19/24</td><td>Young Adults BBQ Hangout</td></tr></table>",
      "dateEntered": "2024-08-26",
      "active": "false",
      "type": "ongoing",
      "category": "ongoing"
    },
    {
      "id": "2024-005",
      "title": "SUNDAY SCHOOL RESUMES THIS SUNDAY @9:30AM",
      "description": "If your child is between 2 ½ years old and 12th grade, please check the foyer for information on where they should go for Sunday school. If you're new, there's a signup sheet available to register your child. Contact Pastor Jerry for any questions (<a href=\"mailto:jerry.ornelas@cpcnewhaven.org\">jerry.ornelas@cpcnewhaven.org</a>).",
      "dateEntered": "2024-08-25",
      "active": "true",
      "type": "upcoming",
      "category": "upcoming"
    },
    {
      "id": "2024-006",
      "title": "Adult Sunday Studies - Walking with Jesus Thru Sinai",
      "description": "We need moral clarity in this age of chaos! What is the good life? How should I treat my neighbor? What does the Bible say about social justice, adultery, covetousness, or slander? Does the Sabbath matter anymore? To answer these questions and more, this year we're \"Walking with Jesus Thru Sinai.\" More than a badge to prove our self-righteousness or a burden to leave us in guilt, the 10 Commandments are summaries of what a flourishing life before God is meant to look like. It shows us how we are made and how we ought to live. This class will be an opportunity to discuss all sorts of crucial issues, from idolatry and worship to moral virtues and political beliefs. Grounded in the grace of Christ, the law becomes a beautiful vision for all our lives. All are welcome! We meet in the Fellowship Hall.",
      "dateEntered": "2024-09-01",
      "active": "true",
      "type": "ongoing",
      "category": "ongoing"
    },
    {
      "id": "2024-007",
      "title": "Women's Discipleship - New Year Beginning September 16",
      "description": "Join us for Women's Discipleship starting September 16 at 7:30 PM. We'll be meeting via Zoom on the 1st and 3rd Mondays of each month. Our study will focus on the book 'Now and Not Yet' by Ruth Chou Simons. We'll alternate between exploring the book and discussing practical applications of what we learn about God, the sufficiency of Christ, and the Holy Spirit. This will involve sharing and praying together. For more information, please contact Lisa Graham (lisahgraham44@gmail.com) or Diane Miller (auntie.diane@comcast.net).",
      "dateEntered": "2024-09-01",
      "active": "true",
      "type": "upcoming",
      "category": "upcoming"
    },
    {
      "id": "2024-008",
      "title": "Mom's Discipleship - Fall Meetings Begin September 17",
      "description": "Mom's Discipleship group will have its first fall meeting on September 17 at 7 PM at CPC. The group will meet twice a month on Tuesday evenings, with a virtual option available at the same time. We'll continue reading 'Intimate Allies' by Dan Allender, but newcomers are welcome to join without catching up on the book. This is a great opportunity for mutual encouragement in your season of motherhood. For more information or to express interest, please contact Meg Bogue at mhbogue@me.com.",
      "dateEntered": "2024-09-01",
      "active": "true",
      "type": "upcoming",
      "category": "upcoming"
    },
    {
      "id": "2024-009",
      "title": "Nursery Orientation | September 29",
      "description": "We will be having an orientation to the nursery for our new volunteers and for anyone who wishes to be refreshed on our rules and nursery practices. It will be held in the nursery on September 29 directly following the service.",
      "dateEntered": "2024-09-01",
      "active": "true",
      "type": "upcoming",
      "category": "upcoming"
    },
    {
      "id": "2024-010",
      "title": "Pastor Drop-in Office Hours",
      "description": "Drop in for a casual time of discussion, Q&A, prayer, coffee, tea, really whatever you want to make it! Wondering what God is doing in a certain part of your life? Let's wonder together! Have a tricky situation at home or work? Let's discern best steps! Want to just chat about nothing in particular? Come on in! If you have a more private or formal need, you're always welcome to set up a separate time with Pastor Craig (<a href=\"mailto:craig.luekens@cpcnewhaven.org\">craig.luekens@cpcnewhaven.org</a>), or Pastor Jerry (<a href=\"mailto:jerry.ornelas@cpcnewhaven.org\">jerry.ornelas@cpcnewhaven.org</a>) but this is meant to be a space where anyone can drop in.<br><br><strong>Craig:</strong> Fridays 7:30-10:30am<br><strong>Jerry:</strong> Wednesdays 3:30-6:00pm",
      "dateEntered": "2024-09-08",
      "active": "true",
      "type": "ongoing",
      "category": "ongoing"
    }

  ]
}