{
  "announcements": [
    {
      "id": "2026-036",
      "title": "Easter Fellowship Meals | Sunday, April 5",
      "description": "Sign up now to Host or Join others in the congregation for an Easter meal. All are welcome! Easter is an opportunity for us to celebrate the risen King as a family. What better way to do this than sitting around a table with family and friends giving thanks to Jesus for his wonderful gift of salvation?",
      "dateEntered": "2026-03-01",
      "active": "true",
      "type": "easter",
      "category": "easter",
      "tag": "fellowship"
    },
    {
      "id": "2026-035",
      "title": "Good Friday Service: “Does God Lament?” | April 3 @ 6:30pm",
      "description": "Readers and musicians needed, please email admin@cpcnewhaven.org if you’re interested in being involved. And consider who you can invite to the service!",
      "dateEntered": "2026-03-01",
      "active": "true",
      "type": "easter",
      "category": "easter",
      "tag": "service"
    },
    {
      "id": "2026-034",
      "title": "Egg Hunt | Saturday, March 28 @ 11am",
      "description": "If your children love hunting for easter eggs, come join us at CPC for a youth-sponsored Easter Egg hunt. We will have plenty of eggs filled with all sorts of goodies, games to play, and plenty of fun to be had. Invite your friends, family, and neighbors.",
      "dateEntered": "2026-03-01",
      "active": "true",
      "type": "easter",
      "category": "easter",
      "tag": "youth"
    },
    {
      "id": "2026-033",
      "title": "Save the Date! Spring Work Day | Saturday, March 21",
      "description": "Join your church family as we take care of our grounds and building before Easter weekend. This is a (surprisingly fun!) time of service and fellowship, as we do the church’s version of Spring cleaning. This is the second of only two work days each year. There will be projects available for all skill levels!",
      "dateEntered": "2026-02-27",
      "active": "true",
      "type": "event",
      "category": "event",
      "tag": "workday"
    },
    {
      "id": "2026-032",
      "title": "Newcomer’s Lunch | This Sunday During Lunch",
      "description": "For those who are new, or new-ish, join us for a “Newcomer’s Lunch” This Sunday, March 1 in the Lecture Room to learn more about CPC and to meet some of our leadership teams. Lunch will be provided in the Lecture Room for you, just head there! Also, fill out a Welcome Card from the pew and return it to the Welcome Bar in the foyer.",
      "dateEntered": "2026-02-27",
      "active": "true",
      "type": "event",
      "category": "event",
      "tag": "newcomer"
    },
    {
      "id": "2026-031",
      "title": "Emeritus Celebration | Sunday Feb. 22 | Fellowship Hall Lunch",
      "description": "Join us as we celebrate the faithful service of some of our previous Shepherd Leaders. Rob Hawkes has become Elder Emeritus, Lisa Hawkes is WLB Emeritus, and we're also celebrating JoAnn Kupiec and Lisa Graham, who served as WLB several years ago. There will be brief mention of their service and an open mic time to share your experience of their faithfulness and inspiration.",
      "dateEntered": "2026-02-15",
      "active": "false",
      "type": "event",
      "category": "event",
      "tag": "celebration"
    },
    {
      "id": "2026-029",
      "title": "Interested in Joining the Body of Christ at CPC?",
      "description": "We consider the church an essential element of the gospel, so joining CPC as a member is a way to truly join the body of Christ, in all its blessings and with all its flaws! Before joining, you'll meet one-on-one with a pastor and then discuss how you've come to know Christ with the Shepherd Leaders. Contact Alexis Vano (admin@cpcnewhaven.org) to begin the process. Our next joining will take place on Sunday, April 19.",
      "dateEntered": "2026-02-10",
      "active": "true",
      "type": "announcement",
      "category": "membership",
      "tag": "membership"
    },
    {
      "id": "2026-030",
      "title": "New Adult Sunday Studies Class Begins Sunday Feb. 15",
      "description": "We're starting a four-week class titled \"Missionally Living in our Neighborhoods,\" which will include a theology of mission as well as guest speakers sharing their wisdom and passion about mission. All are welcome, 9:30am in the Fellowship Hall.",
      "dateEntered": "2026-02-10",
      "active": "true",
      "type": "event",
      "category": "event",
      "tag": "sunday-school"
    },
    {
      "id": "2026-022",
      "title": "Christian Leadership Training is back TODAY Friday, January 30",
      "description": "For all those interested in shaping the future culture of our church! We're holding monthly training sessions on key topics such as: Gospel-centered community, Small Group Leadership, Missional Living & Hospitality, and Lay Counseling. This class builds on the Total Christ vision from Sunday School. It is especially for small group leaders and anyone aspiring to grow in their faith and service to the church. All are welcome. Continues today, 6:30-8:30pm, meal provided. See website for readings.",
      "dateEntered": "2026-01-30",
      "active": "false",
      "type": "event",
      "category": "event",
      "tag": "training"
    },
    {
      "id": "2026-023",
      "title": "Newcomer's Lunch | THIS SUNDAY, February 1 | During Lunch",
      "description": "For those who are new, or new-ish, join us for a \"Newcomer's Lunch\" in the Lecture Room to learn more about CPC and to meet some of our leadership teams. Lunch will be provided in the Lecture Room for you, just head there! Also, fill out a Welcome Card from the pew and return it to the Welcome Bar in the foyer.",
      "dateEntered": "2026-01-30",
      "active": "false",
      "type": "event",
      "category": "event",
      "tag": "newcomer"
    },
    {
      "id": "2026-024",
      "title": "College Game Night | THIS SUNDAY, 5-7pm in CPC Fellowship Hall",
      "description": "If you're an undergraduate student and enjoy playing an assortment of games, come join us for a bit of fun and fellowship. Be sure to grab our new brochure in the foyer to see what college events are coming up!",
      "dateEntered": "2026-01-30",
      "active": "false",
      "type": "event",
      "category": "event",
      "tag": "college"
    },
    {
      "id": "2026-025",
      "title": "Youth Winter Camp | February 28 | 10am-2pm",
      "description": "Join students from across southern New England in a joint youth event with our Presbytery! We will be in Whitinsville Christian School in eastern Massachusetts for a half day of team games, lunch, worship, and small groups. Cost is $10 per student. Age range, 6th to 12th grade. If you are interested and wish to join, contact Pastor Jerry.",
      "dateEntered": "2026-01-30",
      "active": "false",
      "type": "event",
      "category": "event",
      "tag": "youth"
    },
    {
      "id": "2026-026",
      "title": "Regular Sunday Schedule",
      "description": "<strong>8:30am | Prayer in the Parlor</strong><br><br><strong>9:30am | Children's Sunday School</strong><br><br><strong>9:30am | Adult Sunday Studies</strong> - \"Missionally Living in our Neighborhoods\" (4-week class began Feb. 15)<br><br><strong>10:30am | Worship Service</strong><br><br><strong>12:00pm | Fellowship Lunch</strong>",
      "dateEntered": "2026-01-29",
      "active": "true",
      "type": "ongoing",
      "category": "ongoing",
      "tag": "schedule"
    },
    {
      "id": "2026-027",
      "title": "Life Groups and Discipleship Groups",
      "description": "Life Groups and Discipleship Groups are our way of doing \"church in the small\" where we meet throughout Greater New Haven to be engaged in prayer, teaching, fellowship and care. For information on which Life Group may be a good fit, contact Alexis, admin@cpcnewhaven.org.",
      "dateEntered": "2026-01-29",
      "active": "true",
      "type": "ongoing",
      "category": "ongoing",
      "tag": "groups"
    },
    {
      "id": "2026-028",
      "title": "Friday Pastor Drop-In Office Hours",
      "description": "Craig, Fridays 7:30-10:30am | Other hours available upon request",
      "dateEntered": "2026-01-29",
      "active": "true",
      "type": "ongoing",
      "category": "ongoing",
      "tag": "office"
    }
  ]
}