{
  "announcements": [
    {
      "title": "NEXT SUNDAY-ELDER ORDINATION",
      "description": "We are grateful for God’s provision of two new Ruling Elders for the shepherding of our church. Next Sunday in the worship service Tyler Rice and Joshua Kebabian will be ordained to this sacred office. All members will be taking a vow as well. Praise God for His faithful undershepherds!",
      "dateEntered": "2024-04-14",
      "active": "false"
    },
    {
      "title": "I HEART NEW HAVEN DAY JUNE 1ST",
      "description": "Mark your calendars for June 1st for Bridges of Hope’s annual I Heart New Haven Day! This is an exciting day joining with other churches around the city to love the greater New Haven area with projects such as clean up, gardening, painting, and repair at places like soup kitchens, local schools, animal shelters and many other places. As always, we’ll gather on the green for worship and prayer first, and then disperse out to our projects. Please register now!",
      "dateEntered": "2024-04-14",
      "backgroundIMG": "https://static01.nyt.com/images/2022/06/05/realestate/01LIVING-NEWHAVEN-01/01LIVING-NEWHAVEN-videoSixteenByNineJumbo1600.jpg",
      "active": "false"
    },
    {
      "title": "ALL ARE WELCOME TO JOIN US FOR LUNCH DOWNSTAIRS",
      "description": "VISITORS EAT FREE",
      "dateEntered": "2024-04-14",
      "active": "false"
    },
    {
      "title": "JOINT ASCENSION SERVICE MAY 19TH 4PM @CPC EAST LYME",
      "description": "We will be worshiping with the other local Mission Anabaino churches and church plants, this time at the worship service of our newest church plant in East Lyme. Let’s join together in praise with brothers and sisters from the Hill, Fairfield, Norwalk, Wallingford, Milford, and East Lyme! There will be a meal afterwards, which is a great chance to fellowship with other Christians from around Southern CT. Location is Niantic Baptist Church building, 443 Main St., Niantic, CT 06357. Note the change in date from previously published.",
      "dateEntered": "2024-04-14",
      "backgroundIMG": "https://ctvisit.com/sites/default/files/styles/square_600x600/public/mccooksunrise.jpg?itok=gUbFV7yD",
      "active": "false"
    },
    {
      "title": "WOMEN’S HAPPY HOUR MAY 31ST",
      "description": "Please join the Women of CPC as we gather on the terrace of Il Gabbiano on Friday, May 31st from 4-7:30pm (we will be inside if the weather doesn't cooperate). Appetizers are on us and Happy Hour drink pricing is from 4-5pm. Come kick off the weekend, catch up with each other, and have a little fun with your CPC sisters. Il Gabbiano is located at 50 Long Wharf Drive in New Haven. We hope to see you there!",
      "dateEntered": "2024-04-14",
      "active": "false"
    },
    {
      "title": "JOIN THE GREEN TEAM!",
      "description": "If you are interested in serving your church while getting exercise AND having fun-in-the-sun when the weather is not, well, WINTER!, then contact jennifer@cpcnewhaven.org right away! We are in need of anyone who has two legs, at least 20/50 vision, and an hour or so available every 6-8 weeks during the growing season to help keep our beautiful non-native shortgrass meadow under control, and ready for picnics. All those interested in free, impromptu fine gardening and horticulture lessons from a certified professional may also apply.",
      "dateEntered": "2024-06-24", 
      "active": "true"
    },
    {
      "title": "PASTOR’S BOOK PICK - The Life We’re Looking For",
      "description": "This summer, we’re suggesting that you pick up Andy Crouch’s latest book - The Life We’re Looking For: Reclaiming Relationship in a Technological World. This is a perfect followup to The Soul of Shame, as it gets us to reconsider all the ways we are distracted or prevented from deeper relationships. Crouch is a wonderfully thoughtful and practical Christian thinker, who served as a Campus Minister at Harvard, and now works primarily as a consultant at Praxis for redemptive entrepreneurship. This is a great summer read to help us all prioritize and re-calibrate our lives around Christ! Copies are in the foyer, pay what you can.",
      "dateEntered": "2024-06-24", 
      "active": "true"
    },
    {
      "title": "SUMMER COLLEGE BIBLE STUDY WEDNESDAYS at 6PM",
      "description": "If you are in college, or are preparing to go to college, and are sticking around for the summer, join me for a summer bible study. We will walk through the book of Judges to see the glory of salvation from sin and ultimately point us to Jesus. We will begin our study at CPC 6PM next Wednesday. Contact Pastor Jerry at jerry.ornelas@cpcnewhaven.org for more information. Friends are welcome.",
      "dateEntered": "2024-06-24",
      "active": "true"
    },
    {
      "title": "JOINING WITH CPC IN THE HILL THIS SUMMER",
      "description": "We’re invited to serve with our brothers and sisters in Christ at our sister church in the Hill this summer. Currently 3-6 volunteers are needed at the Wednesday BBQs beginning on July 3rd through August 21st, from 5pm-7pm.",
      "dateEntered": "2024-06-24",
      "active": "true"
    },
    {
      "title": "MINISTRYSAFE VIDEOS - FOR ANYONE VOLUNTEERING WITH OUR CHILDREN",
      "description": "As we announced at our congregational meeting, we are requiring all children volunteers to watch the Ministry Safe videos before the fall. The video is a Sexual Abuse Awareness training, so some will prefer to watch it in a group, though it can be watched at home at your convenience. We’ll be showing the video after the service in the Fellowship Hall on June 23, July 21, and Aug. 18. You need to only come once. Light snacks will be provided.",
      "dateEntered": "2024-06-24",
      "active": "true"
    },
    {
      "title": "SATURDAY MORNING BAKE ALONG",
      "description": "Women of CPC — Do you have a sweet tooth or do you enjoy having sweet fellowship with one another? Mark your calendars now for Saturday, August 10th at 10am! We'll be gathering at Katalina's Bakery in New Haven (74 Whitney Ave). Our own resident expert baker, Kathy Reiglemann, will host us in a baking class for all skill levels and none ;-). You can also just come hang out over a cup of tea or coffee. Invite a friend or neighbor - It's Scone'a be a good time!",
      "dateEntered": "2024-06-24",
      "active": "true"
    }
  ]
}