{
  "smallGroups": {
    "lifeGroups": {
      "title": "Life Groups",
      "image": {
        "src": "images.smallGroups.lifeGroups",
        "alt": "Life Groups Image"
      },
      "description": [
        "Life Groups are our way of doing church in the small with all sorts of people engaged in prayer, teaching, fellowship, and care.",
        "\"God has so composed the body, giving greater honor to the part that lacked it, that there may be no division in the body, but that the members may have the same care for one another. If one member suffers, all suffer together; if one member is honored, all rejoice together.\" - 1 Corinthians 12:24-26",
        "God's people are the hands and feet of Christ. We cannot experience God and grow spiritually in a truly gospel-centered and biblical way if we are living in isolation. Neither can we say we are flourishing if our brother or sister in Christ is suffering. Bound together with covenant communion, God brings us into new relationships where sacrifice is freedom and giving to others is where we find life.",
        "Life Groups are the vehicle that we use to help its participants continue to experience Christ outside of our worship gatherings and to impart the pastoral care that Christ provides through the love of His people. Thus, the worship, teaching, fellowship, and care for one another supply a more intimate and hands-on encounter with the living Christ."
      ]
    },
    "discipleshipGroups": {
      "title": "Discipleship Groups",
      "image": {
        "src": "images.smallGroups.discipleshipGroups",
        "alt": "Discipleship Groups Image"
      },
      "description": [
        "Christian discipleship is the application of the gospel to every aspect of life. The very gospel that sets us free from the fear of divine and human condemnation is the same power that transforms our relationships, work, and worship.",
        "Biblical discipleship, including word, worship, and fellowship, exists at CPC primarily through Sunday worship, courses offered through the School of Discipleship, and Men’s and Women’s Discipleship Groups.",
        "We encourage all congregation members to participate in both a Life Group and a Discipleship Group. Although there are components of study in each Discipleship Group, their focus is on living and sharing truth through mutual accountability, study, and prayer."
      ]
    }
  },
  "ministries": {
    "children": {
      "title": "Children's Christian Education",
      "image": {
        "src": "images.ministries.children",
        "alt": "Children's Education Image"
      },
      "description": [
        "In an attempt to assist our covenant families in raising their children in the grace of the gospel, we have developed a thoughtful and comprehensive approach towards providing your children with deep and enduring roots in the Christian faith. Our philosophy emphasizes close parent/church cooperation. As a result, our strategy for 'making disciples' seeks to be primarily relational rather than programmatic.",
        "Our curriculum represents both a deductive and inductive approach to education that is intended to give our children a lasting and full knowledge of the Christian faith. Our goal, then, is to help our children become faithful disciples of Christ, well prepared to live and defend the Gospel into the 21st century."
      ],
      "curriculum": [
        "A comprehensive study of the Bible in all its various periods",
        "A systematic study and review of the essential teachings of the classic/evangelical Christian faith",
        "A precious collection of classic hymns to assist in private and public worship",
        "A practical and personal knowledge of Christ as experienced within the loving community of a Christ-centered church",
        "Deductive Bible Study: Children review the Westminster Shorter Catechisms and learn hymns often used in worship",
        "Inductive Bible Study: Each Sunday School class studies the Scripture using lessons and curricula most suited to each age"
      ]
    },
    "youth": {
      "title": "Youth",
      "image": {
        "src": "images.ministries.youth",
        "alt": "Youth Image"
      },
      "description": [
        "Our youth ministry at CPC is the capstone of our broader children's ministry, and targets both junior and senior high. We have many various goings-on throughout the year, but here are some of the offerings we have for our youth:"
      ],
      "offerings": [
        {
          "title": "Sunday School",
          "description": "CPC's Sunday School program goes from preschool through graduation. Our goal is to partner with parents in the Christian discipleship of their kids, in order that our kids ultimately embrace the gospel of grace for themselves."
        },
        {
          "title": "One-On-One Discipleship",
          "description": "Beyond our calendar events, we seek to schedule one-on-one time with students for discipleship. This takes the form of going out for lunch, monthly fellowship gatherings, ice cream, or anything that gives us an opportunity to deepen relationships and minister to the students' needs."
        }
      ],
      "contact": "For any inquiries regarding our youth ministry, contact Jerry Ornelas at jerry@cpcnewhaven.org"
    }
  }
}