{
    "weeklyPreview": [

      {
        "id": "sermonPreview",
        "title": "Sermon Preview",
        "type": "paragraph",
        "content": "Sermon Text: Psalm 143:1-12",
        "links": [
          { "text": "Bulletin", "url": "#" },
          { "text": "Sunday Music: YouTube", "url": "#" },
          { "text": "Spotify", "url": "#" }
        ]
      },

      {
        "id": "ministryGroups",
        "title": "Save the Dates",
        "type": "table",
        "rows": [
          {
            "left": "01 October | 4:30pm",
            "right": "Installation Service of Senior Pastor: Join us for a special worship service of installation for our new Senior Pastor! The service is followed by dinner (there will be no fellowship lunch after morning worship today)."
          },
          {
            "left": "01 October | After Worship",
            "right": "Newcomer Lunch: Grab lunch and join us to learn more about CPC and meet some of our leadership teams."
          },
          {
            "left": "15 October | During Worship",
            "right": "Membership Joining: During worship we will welcome our new members to CPC and celebrate them after! If you are interested in learning more about the process of membership, reach out to Annie (annie.mchugh@cpcnewhaven.org) to set up an initial pastoral meeting."
          },
          {
            "left": "22 October | 9:30am",
            "right": "Special Adult Sunday Studies: Join us for Adult Sunday Studies in the Fellowship Hall with a special class led by Pastor Jerry called Christian Formation for Parents (and the Rest of Us)."
          }
        ]
      },
      {
        "id": "ongoingWeekly",
        "title": "Ongoing Weekly",
        "type": "table",
        "rows": [
          {
            "left": "Sundays | 8:30am",
            "right": "Prayer in the Parlor: Join with fellow members before worship to pray."
          },
          {
            "left": "Sundays | 9:30am",
            "right": "Children’s Sunday School and Adult Sunday Studies: Children meet in their respective classrooms (see flyer in the foyer), and adults meet in the Fellowship Hall for 'What We Believe: Knowing and Loving Our Doctrines' (formerly called Confessional Theology)."
          },
          {
            "left": "Sundays | 12:00pm",
            "right": "Fellowship Meal: Join us for a fellowship lunch after worship every Sunday! We hope you can stay and get to know one-another. If you’re new, we’d love to meet you and this is a great opportunity to do so!"
          },
          {
            "left": "BEGINS 9/22| Fridays | 7am-10am",
            "right": "Drop-in Time with Pastor Craig: Anyone is invited to come to Craig’s office, 2nd floor of the old building (you can ring the Bradley St. doorbell), for a casual time of discussion, Q&A, prayer, coffee, tea, really whatever you want to make it!"
          }
        ]
      }
    ]
  }
  